### 📖 Terraform Plan (infra-pe/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.application_gateway.azurerm_public_ip.app_gw_public_ip will be created
  + resource "azurerm_public_ip" "app_gw_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "italynorth"
      + name                    = "io-p-itn-cgn-pe-agw-pip-01"
      + resource_group_name     = "io-p-itn-cgn-pe-rg-01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.application_gateway.azurerm_user_assigned_identity.app_gw_identity will be created
  + resource "azurerm_user_assigned_identity" "app_gw_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-cgn-pe-agw-user-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + tenant_id           = (known after apply)
    }

  # module.cgn_pe_fe.azurerm_cdn_frontdoor_rule.caching will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_rule" "caching" {
        id                          = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/ruleSets/ruleset/rules/Caching"
        name                        = "Caching"
      ~ order                       = 5 -> 8
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_gateway.module.app_gw.azurerm_application_gateway.this will be created
  + resource "azurerm_application_gateway" "this" {
      + id                          = (known after apply)
      + location                    = "italynorth"
      + name                        = "io-p-itn-cgn-pe-agw-01"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "io-p-itn-cgn-pe-rg-01"
      + tags                        = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + autoscale_configuration {
          + max_capacity = 2
          + min_capacity = 0
        }

      + backend_address_pool {
          + fqdns        = [
              + "io-p-itn-cgn-pe-apim-01.azure-api.net",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "apim-address-pool"
        }

      + backend_http_settings {
          + affinity_cookie_name                = "ApplicationGatewayAffinity"
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "io-p-itn-cgn-pe-apim-01.azure-api.net"
          + id                                  = (known after apply)
          + name                                = "apim-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "probe-apim"
          + protocol                            = "Https"
          + request_timeout                     = 2
          + trusted_root_certificate_names      = []
            # (1 unchanged attribute hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "io-p-itn-cgn-pe-agw-01-ip-conf"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "io-p-itn-cgn-pe-agw-01-443-port"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "io-p-itn-cgn-pe-agw-01-snet-conf"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "io-p-itn-cgn-pe-agw-01-ip-conf"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "io-p-itn-cgn-pe-agw-01-443-port"
          + host_name                      = "api.cgnonboardingportal.pagopa.it"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "api-listener"
          + protocol                       = "Https"
          + require_sni                    = true
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "cgnonboardingportal-pagopa-it"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "io-p-itn-cgn-pe-ssl-profile"
            # (1 unchanged attribute hidden)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "io-p-itn-cgn-pe-apim-01.azure-api.net"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-apim"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
                # (1 unchanged attribute hidden)
            }
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "apim-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "apim-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "api-listener"
          + id                          = (known after apply)
          + name                        = "api-reqs-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "rewrite-rule-set-api"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_policy {
          + cipher_suites        = [
              + "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
              + "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
            ]
          + min_protocol_version = "TLSv1_2"
          + policy_type          = "Custom"
        }

      + ssl_profile {
          + id                           = (known after apply)
          + name                         = "io-p-itn-cgn-pe-ssl-profile"
          + verify_client_cert_issuer_dn = false

          + ssl_policy {
              + cipher_suites        = [
                  + "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
                  + "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
                  + "TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA",
                  + "TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA",
                ]
              + disabled_protocols   = []
              + min_protocol_version = "TLSv1_2"
              + policy_type          = "Custom"
                # (1 unchanged attribute hidden)
            }
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.1"

          + disabled_rule_group {
              + rule_group_name = "REQUEST-920-PROTOCOL-ENFORCEMENT"
              + rules           = [
                  + 920300,
                ]
            }
        }
    }

  # module.application_gateway.module.app_gw.azurerm_monitor_metric_alert.this["backend_pools_status"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "One or more backend pools are down, check Backend Health on Azure portal"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-agw-01-BACKEND_POOLS_STATUS"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-monitor-rg/providers/Microsoft.Insights/actionGroups/cgnperror"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "UnhealthyHostCount"
          + metric_namespace       = "Microsoft.Network/applicationgateways"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0
        }
    }

  # module.application_gateway.module.app_gw.azurerm_monitor_metric_alert.this["compute_units_usage"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Abnormal compute units usage, probably an high traffic peak"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-agw-01-COMPUTE_UNITS_USAGE"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-monitor-rg/providers/Microsoft.Insights/actionGroups/cgnperror"
        }

      + dynamic_criteria {
          + aggregation              = "Average"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 2
          + evaluation_total_count   = 2
          + metric_name              = "ComputeUnits"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterOrLessThan"
        }
    }

  # module.application_gateway.module.app_gw.azurerm_monitor_metric_alert.this["failed_requests"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Abnormal failed requests"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-agw-01-FAILED_REQUESTS"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-monitor-rg/providers/Microsoft.Insights/actionGroups/cgnperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 2
          + evaluation_total_count   = 2
          + metric_name              = "FailedRequests"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterThan"
        }
    }

  # module.application_gateway.module.app_gw.azurerm_monitor_metric_alert.this["response_time"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Backends response time is too high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-agw-01-RESPONSE_TIME"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-monitor-rg/providers/Microsoft.Insights/actionGroups/cgnperror"
        }

      + dynamic_criteria {
          + aggregation              = "Average"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 2
          + evaluation_total_count   = 2
          + metric_name              = "BackendLastByteResponseTime"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterThan"
        }
    }

  # module.application_gateway.module.app_gw.azurerm_monitor_metric_alert.this["total_requests"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Traffic is raising"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-agw-01-TOTAL_REQUESTS"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 3
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-monitor-rg/providers/Microsoft.Insights/actionGroups/cgnperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "Medium"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "TotalRequests"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterThan"
        }
    }

  # module.application_gateway.module.appgateway_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.26.6.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-cgn-pe-agw-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-cgn-pe-rg-01"
      + virtual_network_name                          = "io-p-itn-cgn-pe-vnet-01"
    }

  # module.cgn_pe_apim.module.apim.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-cgn-pe-apim-01"
      + min_api_version               = "2021-08-01"
        name                          = "io-p-itn-cgn-pe-apim-01"
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
        id                  = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-p-itn-cgn-pe-apim-01"
        name                = "io-p-itn-cgn-pe-apim-01"
      ~ records             = [
          - "10.26.2.10",
        ]
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "io-p-itn-cgn-pe-apim-01"
      + resource_group_name = "io-p-itn-cgn-pe-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + ttl                 = 3600
      + zone_name           = "management.azure-api.net"
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_endpoint.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_endpoint" "this" {
        id                       = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01/afdEndpoints/io-p-itn-cgn-pe-frontend-fde-01"
        name                     = "io-p-itn-cgn-pe-frontend-fde-01"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_cdn_frontdoor_profile.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_profile" "this" {
        id                       = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cgn-pe-frontend-afd-01"
        name                     = "io-p-itn-cgn-pe-frontend-afd-01"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_dns_cname_record.this["portal.cgnonboardingportal.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-public-rg/providers/Microsoft.Network/dnsZones/cgnonboardingportal.pagopa.it/CNAME/portal"
        name                = "portal"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (6 unchanged attributes hidden)
    }

  # module.cgn_pe_fe.module.cgn_pe_cdn.azurerm_dns_txt_record.validation["portal.cgnonboardingportal.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "validation" {
        id                  = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/cgnonboardingportal-p-public-rg/providers/Microsoft.Network/dnsZones/cgnonboardingportal.pagopa.it/TXT/_dnsauth.portal"
        name                = "_dnsauth.portal"
      ~ tags                = {
            "Cdn"            = "io-p-itn-cgn-pe-frontend-afd-01"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Origin"         = "portal.cgnonboardingportal.pagopa.it"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.application_gateway.module.agw_identity_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cgn-pe-rg-01|io-p-itn-cgn-pe-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow AGW to access TLS certificates"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 11 to add, 7 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.key_vaults.azurerm_key_vault.cgn_pe,
  on ../_modules/key_vaults/key_vault_cgn_pe.tf line 9, in resource "azurerm_key_vault" "cgn_pe":
   9:   enable_rbac_authorization     = true

This property has been renamed to `rbac_authorization_enabled` and will be
removed in v5.0 of the provider

(and 8 more similar warnings elsewhere)
```

</details>
